examples/of7_8/kEpsilon/0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

kappa                0.4;   // (kappa = 0.4 for equilibrium ; HW2007)
Cmu                  0.09;
Uref                 10.0;
Zref                 20.0;
zDir                 (0 0 1);
flowDir              (1 0 0);
z0                   0.01;
zGround              uniform 0.0;


// Calculate ABL friction velocity U*
ustar #calc     "$Uref*$kappa / log(($Zref+$z0) / $z0)";

// // For Richards and Hoxey (1993) profiles: A=B=C=0; D=ustar^2/sqrt(Cmu)
// // For Parente et al 2011 profile:  A = A_parente; B=C=0; D=A_parente*ln(z0)+B_parente
// A                    0;
// B                    0;
// C                    0;
// D                    #calc  "pow($ustar,2) / pow(0.09,0.5)"; // Richards Hoxey
// E                    0;


// Parameters for fitting TKE profile

C1                    -0.5;   //  Curve-fitting coefficient
C2                    4;   //  Curve-fitting coefficient

A                    0;
B                    0;
C                    0;
D                    $C2;
E                    $C1;

  
// Note: If C1 < 0, Z0 is small, and Zmax is large, code may fail due to negative value under sqrt (to fix)


// ************************************************************************* //

CmuMax  0.35;     // Upper limit for Cmu calculated based on Parente et al Eq.11.
//Note: CmuMax may affect homogeniety at upper end of domain

BW      0;        // Flag for TKE profile (0: Eq.7 Balogh et al)
hABL    1;        // TKE profile parameter, used when BW/=0 


// Blending parameters
blendCoeff      0.0;     // Blending parameter "alpha" in Eq.22 Bellegoni et al (2023). blendCoeff = 0 for homogenous ABL

// Wall function parameters
kappaWF         $kappa;
Etke            $E;      // Same parameter as E. Renamed Etke in WF code to avoid conflict with Edash 
WFCmu           0.09;    // Cmu in Wake Field. No effect if blendCoeff = 0
roughWall       1;       // Flag for epsilon and nut wall functions


// Upper limits on deltau, deltak and deltae (Eq. 23 Bellegoni 2023)
// No effect if blendedCoeff = 0 
thresholdU      1;
thresholdE      1;
thresholdK      1;
thresholdO      1;

// Attenuation parameter to avoid over-extent of BIA. (=1/A in Eq. 23 of Bellegoni et al (2023))?
// No effect if blendedCoeff = 0 
constantU       1; // Au = 1
constantE       10; // Ak = 0.1
constantK       10; // Ae = 0.1
constantO       10; // Ae = 0.1